import sympy as sp # Імпортування бібліотеки sympy, необхідної у даній програмі для роботи з вводом підінтегрального виразу та підвищення інтерактивності

def calculating_h(a, b, m):
    n = 2 * m
    return n, (b-a)/n
"""
Функція calculating_h(a, b, m) необхідна для обчислення кількості підінтервалів та кроку підінтервалу.
Аргументами функції виступають нижня та верхня межі інтегрування та m - кількість пар підінтервалів.
Функція відразу повертає обчислені значення n та h.
"""

def calculating_func(function, x, a, h, n):
    result = [] # Оголошення списку

    # Обчислення значення функції на кожному підінтервалі та занесення результату до списку
    for i in range(n + 1):
        xi = a + i * h
        yi = function.subs(x, xi).evalf()
        result.append(yi)

    return result
"""
Функція calculating_func(function, x, a, h, n) обчислює значення введеної користувачем функції та заносе їх у список, починаючи від нижнього межі інтегрування з кроком h.
Функція приймає аргументами саму функцію, що ввів користувач, змінну цієї функції, нижню межу інтегрування a, крок h та кількість підінтервалів n.
Функція повертає список отриманих значень функції, необхідних для подальших обчислень.
"""

def calculating_Simpson(result, h, n):
    even_points = [yi for i, yi in enumerate(result) if i != 0 and i != n and i % 2 == 0] # Створення списку, що містить значення функції, що мають парні індекси та не включає межі інтегрування
    odd_points = [yi for i, yi in enumerate(result) if i != 0 and i != n and i % 2 != 0] # Створення списку, що містить непарні значення функції та не включає межі інтегрування
    sum_even = 0 # Оголошення та ініціалізація суми значень функції, що мають парні індекси
    sum_odd = 0 # Оголошення та ініціалізація суми значень функції, що мають непарні індекси

    # Обчислення суми значень функцій, що мають парні та непарні індекси
    for yi in even_points:
        sum_even += yi
    for yi in odd_points:
        sum_odd += yi
    return (h/3) * (result[0] + result[n] + (2 * sum_even) + (4 * sum_odd)) # Обчислення за формулою Сімпсона
"""
Функція calculating_Simpson(result, h, n) необхідна для обчислення приблизного значення інтегралу за формулою Сімпсона.
Функція приймає аргументами список result, що містить обчисленні значення функції на розбитих інтервалах.
Функція повертає результат обчислень за формулою
"""

def main():
    print("~" * 15, "ЧИСЕЛЬНЕ ІНТЕГРУВАННЯ ФУНКЦІЇ ЗА ФОРМУЛОЮ СІМПСОНА", "~" * 15)
    while True:
        print("~" * 30)
        print("ГОЛОВНЕ МЕНЮ ПРОГРАМИ:")
        print("=" * 30)
        print(">1< - Знайти приблизне значення визначеного інтегралу;\n>2< - Вихід з програми.")
        print("=" * 30)
        print("~" * 30, "\n")
        print("-" * 30)
        choice = input("Введіть ваш вибір: ")
        print("-" * 30, "\n")
        if choice == '1':
            x = sp.symbols('x') # Змінна, що буде використана у підінтегральному виразі
            print("-" * 30)
            user_input = input("Введіть підінтегральний вираз f(x): ") # Введення користувачем рівняння
            print("-" * 30, "\n")

            try:
                # 1. Спроба перетворити рядок у SymPy-вираз
                expr = sp.sympify(user_input) # Перетворення рядка у SymPy-вираз
                # Перевірка, чи використані тільки дозволені змінні, тобто "х"
                if expr.free_symbols.issubset({x}):
                    print("-" * 30)
                    print(f"Ваш підінтегральний вираз: {expr} dx")
                    print("-" * 30, "\n")
                else:
                    raise ValueError("[ПОМИЛКА] - Рівняння містить недозволені змінні!")
            # Обробка виключних ситуацій
            except Exception as e:
                print("-" * 30)
                print("[ПОМИЛКА] - Деталі:", e)
                print("-" * 30)
                exit() # Завершення програми з кодом помилки

            try:
                # Введення параметрів у програму
                print("-" * 30)
                epsilon = float(input("Введіть точність обчислень epsilon: "))
                print("-" * 30, "\n")
                # Перевірка на правильність введених даних
                while epsilon < 0 or epsilon > 1:
                    print("-" * 30)
                    epsilon = float(input("[УВАГА] - Введіть ще раз правильно точність обчислень epsilon: "))
                    print("-" * 30, "\n")
                print("-" * 30)
                print(f"Введіть межі інтегрування підінтегрального виразу {expr}, де a - нижня межа інтегрування, а b - верхня")
                a = float(input("a = "))
                b = float(input("b = "))
                print("-" * 30, "\n")
                # Перевірка на правильність введених даних
                while a > b:
                    print("-" * 30)
                    print(f"[УВАГА] - Введіть правильні межі інтегрування підінтегрального виразу {expr}, де a - нижня межа інтегрування, а b - верхня")
                    a = float(input("a = "))
                    b = float(input("b = "))
                    print("-" * 30, "\n")
            # Обробка виключних ситуацій
            except Exception as e:
                print("-" * 30)
                print("\n[Помилка] - Деталі:", e)
                print("-" * 30)
                exit()

            m = 1 # Початкове значення m
            n, h = calculating_h(a, b, m)
            print("~" * 30)
            print("ДАНО:")
            print("=" * 30)
            print(f"Підінтегральний вираз: {expr} dx\nНижня межа інтегрування: {a}\nВерхня межа інтегрування: {b}\nПочаткова кількість пар підінтервалів (m): {m}\nПочаткова кількість підінтервалів (n): {n}\nПочатоквий крок (h): {h}\nТочність обчислень: {epsilon}")
            print("=" * 30)
            print("~" * 30, "\n")
            # Обчислення значення "маленького" Сімпсона з початковим кроком
            print("")
            print("-" * 30)
            print("Процес наближеного обчислення інтегралу за формулою Сімпсона...")
            print("-" * 30, "\n")
            print("")
            result = calculating_func(expr, x, a, h, n)
            simpson = calculating_Simpson(result, h, n)

            while True: # Нескінченний цикл
                # Обчислення значення "великого" Сімпсона з початковим кроком
                m *= 2
                n, h = calculating_h(a, b, m)
                result = calculating_func(expr, x, a, h, n)
                Simpson = calculating_Simpson(result, h, n)
                R_2 = abs(simpson - Simpson) / 15
                if R_2 <= epsilon: # Умова виходу з циклу
                    break
                simpson = Simpson

            print("~" * 30)
            print("РЕЗУЛЬТАТ:")
            print("=" * 30)
            print(f"Приблизне значення визначеного інтегралу виразу {expr} з межами від {a} до {b} дорівнює {simpson}\nз кроком {h}, кількістю підінтервалів n = {n}, з точністю epsilon = {epsilon} та оцінкою похибки R_2 = {R_2}")
            print("=" * 30)
            print("~" * 30, "\n")
        elif choice == '2':
            print("-" * 30)
            print("[УВАГА] - Завершення роботи програми...")
            print("-" * 30)
            break
        else:
            print("-" * 30)
            print("[ПОМИЛКА] - Неправильно введене значення вибору!\n(Спробуйте ще раз)")
            print("-" * 30, "\n")
            continue
"""
Функція main() - головна функція програми
"""

main() # Виклик головної функції
